import React, {Component} from 'react'

export default class Protocal extends Component {
    render() {
        const {hide} = this.props
        return (
            <div className="modalBox ym-protocalBox">
                <h4>领养协议</h4>
                <div className="content">
                    <div>在此特别提醒你（以下或简称“用户”）在注册成为用户之前，请认真阅读本《用户协议》（以下或简称“本协议”），确保你充分理解本协议中各条款，特别是涉及免除或者限制责任的条款、权利许可和信息使用的条款、同意开通的条款、法律适用和争议解决条款等。其中，免除或者限制责任条款等重要内容你应重点阅读。如你未满18周岁，请你在法定监护人陪同下仔细阅读并充分理解本协议，并征得法定监护人的同意后使用本网站服务。请你审慎阅读并选择接受或不接受本协议。</div>
                    <div>除非你接受本协议所有条款，否则你无权注册、登录或使用（以下统称“使用”）本网站服务，或者获得本网站提供的任何服务。你访问本网站的行为及通过各类方式利用本网站或使用本网站的相关服务，将视为你已充分理解本协议，并承诺作为本协议的一方当事人接受本协议各项条款的约束，你对本协议的全部内容表示自愿且无异议的认可。</div>
                    <div>第一条 你确认，在你完成注册时，你应当是具备相应民事行为能力的自然人、法人或其他组织。</div>
                    <div>第二条
                        你在从事与本网站相关的所有行为（包括但不限于访问浏览、利用、转载、宣传介绍）时，必须以善意且谨慎的态度行事，不得故意或者过失的损害本网站的各类合法权益，不得利用本网站以任何方式直接或者间接从事违反中华人民共和国法律法规、国际公约、社会公序良俗或侵害他人合法权益的行为。你理解并同意，如你被他人投诉侵权或你投诉他人侵权，上海景栗信息科技有限公司（下称“景栗”或“公司”）有权将争议中相关方的主体、联系方式、投诉相关内容等必要信息提供给其他争议方或相关政府职能部门和/或司法机关，以便及时解决投诉纠纷，保护他人合法权益。</div>
                    <div>第三条 用户不得自行或通过群宠物利用本网站服务传播如下法律、法规和政策禁止的内容：
                        <ul style={{paddingLeft: '30px'}}>
                            <li>1) 反对宪法所确定的基本原则的；</li>
                            <li>2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</li>
                            <li>3) 损害国家荣誉和利益的；</li>
                            <li>4) 煽动民族仇恨、民族歧视，破坏民族团结的；</li>
                            <li>5) 破坏国家宗教政策，宣扬邪教和封建迷信的；</li>
                            <li>6) 散布谣言，扰乱社会秩序，破坏社会稳定的；</li>
                            <li>7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</li>
                            <li>8) 侮辱或者诽谤他人，侵害他人合法权益的；</li>
                            <li>9) 含有法律、行政法规禁止的其他内容的信息。</li>
                        </ul>
                    </div>
                    <div>第四条
                        本协议中所称之“群宠物”，系由景栗以外的第三方所开发、公布、分发的计算机软件程序。在你按照注册页面提示填写信息、阅读并同意本协议，完成全部群宠物领用程序后或以公司允许的方式使用群宠物服务，并且以明示或默示的方式直接支付或授权公司自你所得的佣金中自动划扣获取群宠物所需支付的对价（景栗将代用户向群宠物的开发者给付购买该群宠物的对价款）后，即表示你自愿接受本协议的约束且自动享有该群宠物（作为“网络虚拟财产”）的所有权并自愿承担与此相关的权利义务。群宠物在进入微信群后，公司不承担由于你及群宠物发送内容所引起的任何法律责任和经济损失，你对此表示知悉并确认。</div>
                    <div>第五条 景栗建议，任何未满18周岁的未成年人参加网上活动应事先取得其监护人（以下简称"监护人"）的同意并遵守《青少年网络文明公约》。</div>
                    <div>第六条 景栗将在群宠物系统公布并不时修订隐私权政策，隐私权政策构成本协议的有效组成部分。</div>
                    <div>第七条
                        你允许景栗或景栗授权的第三方收集你在使用本网站服务过程中所产生的个人信息。但景栗承诺将根据法律法规的规定，保护你的个人信息安全。为保护你的个人信息的安全，景栗一直并将继续努力采取各种合理的物理、电子和管理方面的安全措施来保护用户信息，使用户的信息不会被泄漏、毁损或者丢失，包括但不限于信息加密存储、数据中心的访问控制。景栗对可能接触到用户的信息的员工也采取了严格管理，包括但不限于根据岗位的不同而设置不同的权限，与员工签署保密协议等措施。对此你表示理解和认同。</div>
                    <div>第八条
                        你知悉并确认，景栗有权根据法律、法规、政策或商业需要，修改、冻结、停止结算用户通过用户自身行为和群宠物所获得的佣金。对于使用非正常手段获取佣金的用户，景栗有权冻结、停用该用户账户，停止其账户佣金的提现，并保留通过法律手段追讨其非法所得的权利。</div>
                    <div>第九条 网站中描述的佣金获取规则供参考使用，景栗有权随时修改佣金获取或提取规则，修改规则无需提前通知用户，无需征得用户事先同意。</div>
                    <div>第十条
                        你理解并同意，景栗会尽最大努力向你提供服务，确保服务的连贯性和安全性，但公司不能随时预见和防范技术以及其他风险，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方（包括但不限于：群宠物的开发者等）服务瑕疵及其他各种安全问题的侵扰等原因可能导致的服务中断、数据丢失以及其他的损失和风险。为了服务整体运营的需要，景栗有权在公告通知后修改、中断、中止或终止相关服务，而无须向用户负责或承担任何赔偿责任。</div>
                    <div>第十一条
                        本协议在中华人民共和国上海市签署。本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律。若因本网站产生任何诉诸于诉讼程序的法律争议，双方均同意将争议提交公司所在地有管辖权的人民法院通过诉讼解决。</div>
                    <div>第十二条
                        本协议之订立、修改、更新及最终解释权均属景栗所有，景栗有权不时变更本协议相关内容而无需提前通知用户。本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。你在点击确认本协议后，即表示自愿立即接受本协议所有条款的约束。</div>
                    <div>第十三条 以上协议于公布之日起生效。</div>
                </div>
                <div className="icon-cross closeBtn" onClick={hide}/>
            </div>
        )
    }
}